app/views/home/video.html.erb

SELECT "incert_videos".* FROM "incert_videos" ORDER BY id LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "incert_videos"
---

<% @incert_videos = IncertVideo.order(:id).page params[:page] %>