app/controllers/admin_controller.rb

  def documents
   if current_user.role == "admin"
    @docuent_file = DocuentFile.new
    @docuent_files = DocuentFile.all
---
SELECT "docuent_files".* FROM "docuent_files"

  def gallery
     if current_user.role == "admin"
       @photo = Photo.new
       @gallery_private = Photo.where(:add_gallery => 'private')
---
SELECT "photos".* FROM "photos" WHERE "photos"."add_gallery" = 'private'

  def users
    if current_user.role == "admin"
    @users = User.all
---
SELECT "users".* FROM "users"