app/controllers/docuent_files_controller.rb

  def index
    @docuent_files = DocuentFile.all
---
SELECT "docuent_files".* FROM "docuent_files"

  def show
    @docuent_file = DocuentFile.find(params[:id])
---
SELECT "docuent_files".* FROM "docuent_files" WHERE "docuent_files"."id" = ? LIMIT 1  [["id", "1"]]

  def create
  if current_user.role == "admin"

    @docuent_file = DocuentFile.new(params[:docuent_file])

    respond_to do |format|
      if @docuent_file.save
---
INSERT INTO "docuent_files" ("created_at", "description", "documents", "image_file", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)