app/controllers/incert_videos_controller.rb

  def index
    @incert_videos = IncertVideo.all
---
SELECT "incert_videos".* FROM "incert_videos"

  def show
    @incert_video = IncertVideo.find(params[:id])
---
SELECT "incert_videos".* FROM "incert_videos" WHERE "incert_videos"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @incert_video = IncertVideo.new(params[:incert_video])

    respond_to do |format|
      if @incert_video.save
---
INSERT INTO "incert_videos" ("created_at", "updated_at", "video_url") VALUES (?, ?, ?)  [["created_at", Wed, 03 Apr 2013 22:25:14 UTC +00:00], ["updated_at", Wed, 03 Apr 2013 22:25:14 UTC +00:00], ["video_url", "http://vimeo.com/video/63206835"]]

  def destroy
    @incert_video = IncertVideo.find(params[:id])
    @incert_video.destroy
---
SELECT "incert_videos".* FROM "incert_videos" WHERE "incert_videos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "incert_videos" WHERE "incert_videos"."id" = ?  [["id", 1]]