app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."add_gallery" = 'public'
---
  def index
       @gallery_private = Photo.where(:add_gallery => 'private')

INSERT INTO "photos" ("add_gallery", "created_at", "image_file", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["add_gallery", "private"], ["created_at", Thu, 13 Dec 2012 06:23:02 UTC +00:00], ["image_file", "tercertemplo.jpg"], ["title", "templo"], ["updated_at", Thu, 13 Dec 2012 06:23:02 UTC +00:00]]
---
  def create
    if current_user.role == "admin"

    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]
---
  def destroy
    if current_user.role == "admin"
    @photo = Photo.find(params[:id])
    @photo.destroy